// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length >= 3) {
//     document.write('повідомлення про те, що це великий масив, в якому  3 і більше елементи')
// } else {
//     document.write('це маленький масив, в якому менше 3-х елементів.')
// }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1 = 3;
// let num2 = 2;
// let num3 = 5;
//
// let middleNum;
// if ((num1 > num2 && num1 < num3) || (num1 < num2 && num1 > num3)) {
//     middleNum = num1;
//
// } else if ((num2 > num1 && num2 < num3) || (num2 < num1 && num2 > num3)) {
//     middleNum = num2;
// } else {
//     middleNum = num3;
// }
// console.log("Середнє число: " + middleNum);
//
//
// if ((num1 > num2 && num1 < num3) || (num1 < num2 && num1 > num3)) {
//     console.log(num1 + " знаходиться між " + num2 + " та " + num3);
// } else {
//     console.log(num1 + " не знаходиться між " + num2 + " та " + num3);
// }

// - Перепишіть конструкцію if з використанням умовного оператора '?':

// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let result = (a + b < 4) ? 'Мало' : 'Багато';

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let num = 20;
// let result = (num > 0) ? 'позитивне' : (num < 0) ? 'негативне' : 'нуль';
// console.log(result);

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = true
// if (test === true) {
//     console.log('Вірно')
// } else {
//     console.log('Неправильно')
// }

////тернарка

// let test1 = true;
// let result = (test1 === true) ? 'Вірно' : 'Неправильно';
// console.log(result)

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let name = 'ECMA2Script';
//
// if (name==='ECMAScript'){
//     console.log('Правильно!')
// }else {
//     console.log('Не знаєте? ECMAScript!')
// }

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let num = +prompt('Введіть номер квартири від 1 до 90');
// if (num <= 20) {
//     console.log('перший під`їзд')
// } else if (num <= 48) {
//     console.log('другий під`їзд')
// } else {
//     console.log('третій під`їзд')
// }

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('введіть число')
// if (number===10){
//     console.log('вірно')
// } else {
//     console.log('невірно')
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = +prompt('скільки градусів зараз на вулиці?')
// if (temp >= 22 || temp >= 10){
//     console.log('ми йдемо ВЧИТИСЯ')
// }else {
//     console.log('сидимо вдома і вчимося ОНЛАЙН')
// }

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let num = +prompt('Введіть число від 1 до 5');
//
// switch (num){
//     case 1:
//         console.log('авто');
//         break;
//     case 2:
//         console.log('moto');
//         break;
//     case 3:
//         console.log('phone');
//         break;
//     case 4:
//         console.log('imac');
//         break;
//     case 5:
//         console.log('laptop');
//         break;
//     default:
//         console.log('число не вірне')
// }
